Repository: 84000/data-translation-memory
Catalog: toh292-v3.tmx
Source language: bo
Languages: en

source: མདོ་ཆེན་པོ་རྒྱལ་མཚན་མཆོག་ཅེས་བྱ་བ།
en: The Mahāsūtra The Crest Insignia (1)

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་སྤོང་བྱེད་དུ་ཡུལ་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡངས་པ་ཅན་དུ་བྱོན་ནས།
en: The Blessed One was traveling through the land of Vṛji and had arrived in Vaiśālī.

source: ཡངས་པ་ཅན་གྱི་སྤྲེའུ་རྫིང་གི་འགྲམ་གྱི་ཁང་པ་བརྩེགས་པའི་གནས་ན་བཞུགས་སོ། །
en: He had taken up residence at the Kūṭāgāraśālā, on the banks of the Monkey Pond near Vaiśālī.

source: དེའི་ཚེ་ན་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་ཡུལ་རྡོ་འཇོག་ཏུ་ཚོང་པར་བྱ་བའི་ཕྱིར་ཡུལ་རྡོ་འཇོག་ཏུ་འགྲོ་བར་ཆས་པའི་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གིས།
en: At that time, a large group of merchants from Vaiśālī was preparing for a journey to the land of Takṣaśilā in order to trade.

source: བཅོམ་ལྡན་འདས་ཡུལ་སྤོང་བྱེད་དུ་ཡུལ་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡངས་པ་ཅན་དུ་བྱོན་ནས། ཡངས་པ་ཅན་གྱི་སྤྲེའུའི་རྫིང་གི་འགྲམ་གྱི་ཁང་པ་བརྩེགས་པའི་གནས་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །
en: These many merchants of Vaiśālī heard that the Blessed One was traveling through the land of Vṛji, had arrived in Vaiśālī, and had taken up residence at the Kūṭāgāraśālā on the banks of the Monkey Pond near Vaiśālī.

source: ཐོས་ནས་ཀྱང་ཚོགས་ནས་ཚོགས་དང་། མང་པོ་ནས་མང་པོར་ལྷགས་ཤིང་འདུས་ཏེ་ཡངས་པ་ཅན་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: When they heard this, they gathered in groups and banded together in bands, left Vaiśālī, and went to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་པ་དང་།
en: On arrival, they bowed their heads at the Blessed One’s feet and sat to one side.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་ཕྱོགས་གཅིག་ཏུ་འཁོད་པ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དོ། །
en: The Blessed One taught, instructed, encouraged, and delighted the many merchants of Vaiśālī, who were seated to one side, with a Dharma talk.

source: རྣམ་གྲངས་དུ་མར་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: Having taught, instructed, encouraged, and delighted them with a Dharma talk on various topics, the Blessed One sat in silence.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The many merchants of Vaiśālī then rose from their seats and, draping their robes over their left shoulders, bowed to the Blessed One with joined palms.

source: བཙུན་པ་བདག་ཅག་ནི་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་ཡུལ་རྡོ་འཇོག་ཏུ་འཇལ་ཚོང་བགྱི་བའི་སླད་དུ། ཡུལ་རྡོ་འཇོག་ཏུ་མཆི་བར་ཆས་པ་ལགས་ན།
en: “Honored One,” they addressed the Blessed One, “we are a large group of merchants from Vaiśālī preparing for a journey to the land of Takṣaśilā in order to trade goods.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་ཅག་གི་སྡུམ་པར་གདུགས་ཚོད་གསོལ་བར་ཅི་གནང་།
en: Would the Blessed One and the saṅgha of monks agree to take their midday meal at our place tomorrow?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་ལ་ཅང་མི་གསུང་བས་གནང་བར་མཛད་དོ། །
en: The Blessed One assented to the many merchants of Vaiśālī by remaining silent.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས།
en: The many merchants of Vaiśālī recognized that the Blessed One had agreed by remaining silent.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རངས་ནས།
en: They praised what the Blessed One had taught and rejoiced.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཕྱིར་དོང་ངོ་། །
en: They bowed their heads at the Blessed One’s feet and departed from his presence.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གིས་དེ་ཉིད་ཀྱི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བྱ་བ་གཙང་ཞིང་བསོད་པ་དག་ལེགས་པར་སྦྱར་ནས་ནང་པར་སྔར་ལངས་ཏེ། གདན་དག་བཤམས་ཤིང་།
en: That evening, the many merchants of Vaiśālī carefully prepared pure and wholesome food and drink.

source: ཆུ་ར་དག་ཀྱང་བཞག་ནས།
en: Rising early the next morning, they prepared the seating and set out the water jugs.

source: བཅོམ་ལྡན་འདས་ལ་བཙུན་པ་གདུགས་ཚོད་སྦྱར་ཏེ། དུས་ལ་བབ་ལགས་ན།
en: They then extended their invitation to the Blessed One: “Honored One, the meal has been prepared, and the time has come.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་སུ་གསོལ་ཞེས་སྤྱན་འདྲེན་གྱིས་སྤྱན་དྲངས་སོ། །
en: Please, Blessed One, know that the time has now come.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ།
en: That morning, the Blessed One donned his lower garment and upper robe and took up his alms bowl.

source: ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས།
en: Surrounded by a group of monks at the head of the saṅgha of monks, he proceeded to the dining hall of the many merchants of Vaiśālī.

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་དེ་ཉིད་ལ་བཞུགས་སོ། །
en: When he arrived, he sat on the seat that had been prepared for him amid the gathering of monks.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་པ་དང་།
en: The many merchants of Vaiśālī then bowed their heads at the Blessed One’s feet and sat to one side.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་ཕྱོགས་གཅིག་ཏུ་འཁོད་པ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཚོང་པ་དག་གལ་ཏེ་ཁྱེད་ཅག་དགོན་པར་སོན་པ་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་སྐྱེ་བར་གྱུར་ན། དེའི་ཚེ་ཁྱེད་ཀྱིས་འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: The Blessed One gave the following teaching to the many merchants of Vaiśālī, who were seated to one side.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡིན་ནོ་ཞེས་ང་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “Merchants, when you are in the wilderness and you feel fear, trepidation, or terror, at that time, you should recollect me through my aspects: “The Blessed One is a thus-gone one, a worthy one, a perfectly and completely awakened one, a learned and virtuous one, a well-gone one, a knower of the world, an unsurpassed leader of those to be trained, a teacher of devas and humans, an awakened one, and a blessed one.

source: ཚོང་པ་དག་དེའི་ཚེ་ཁྱེད་ཀྱིས་ང་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: “Merchants, if at that time you recollect me through my aspects, then whatever fear, trepidation, or terror you are experiencing will subside.

source: གལ་ཏེ་ང་མི་དྲན་ན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ནི་ལེགས་པར་གསུངས་པ་ཡང་དག་པར་མཐོང་བ། ནད་མེད་པ། དུས་ཆད་པ་མེད་པ། ཉེ་བར་གཏོང་བ་འདི་མཐོང་བ་ལ་དོན་ཡོད་པ། མཁས་པ་རྣམས་ཀྱིས་རང་གིས་རིག་པར་བྱ་བ་ཡིན་ནོ་ཞེས་ཆོས་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “If you cannot recollect me, then recollect the Dharma through its aspects: “The Dharma of the Blessed One has been well spoken, it is to be seen for oneself, it is free from ailments, it is timeless, it is a guide, it is there in plain sight, and it is to be experienced by the wise for themselves.

source: ཚོང་པ་དག་དེའི་ཚེ་ཁྱེད་ཀྱིས་ཆོས་རྣམ་པ་ལྔས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: “Merchants, if at that time you recollect the Dharma through these aspects, then whatever fear, trepidation, or terror you are experiencing will subside.

source: གལ་ཏེ་ཆོས་མི་དྲན་ན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ལེགས་པར་ཞུགས་པ། རིགས་པར་ཞུགས་པ། དྲང་པོར་ཞུགས་པ། འཐུན་པར་ཞུགས་པ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པ།
en: “If you cannot recollect the Dharma, then recollect the Saṅgha through its aspects: “The Saṅgha of śrāvakas of the Blessed One practice well, they practice in the proper way, they practice with integrity, they practice in the right way, they practice the Dharma as befits the Dharma, and they act in accordance with the Dharma.

source: ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པར་སྤྱོད་པ་སྟེ། དགེ་འདུན་ལ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are those who practice to realize the result of stream entry.

source: དགེ་འདུན་ལ་རྒྱུན་དུ་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are stream enterers.

source: དགེ་འདུན་ལ་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are those who practice to realize the result of once-returners.

source: དགེ་འདུན་ལ་ལན་ཅིག་ཕྱིར་འོང་བ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are once-returners.

source: དགེ་འདུན་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are those who practice to realize the result of non-returners.

source: དགེ་འདུན་ལ་ཕྱིར་མི་འོང་བ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are non-returners.

source: དགེ་འདུན་ལ་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་དག་ཀྱང་ཡོད།
en: In the Saṅgha there are those who practice to realize the result of arhathood.

source: དགེ་འདུན་ལ་དགྲ་བཅོམ་པ་དག་ཀྱང་ཡོད་དེ།
en: In the Saṅgha there are arhats.

source: དེ་དག་ནི་སྐྱེས་བུ་ཟུང་བཞི་དང་། སྐྱེས་བུ་གང་ཟག་བརྒྱད་ཡིན་ཏེ།
en: These are the four pairs, the eight types of persons.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དེ་ནི་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ། ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཕུན་སུམ་ཚོགས་པ་ཀུན་དུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ།
en: The Blessed One’s Saṅgha of śrāvakas is replete with discipline, replete with samādhi, replete with wisdom, replete with liberation, and replete with the knowledge and vision of liberation.

source: རབ་ཏུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ། ཐལ་མོ་སྦྱར་བའི་འོས་སུ་གྱུར་པ། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ།
en: They are fully worthy of offerings, they are completely worthy of offerings, they are worthy of respect with joined palms, they are worthy of homage.

source: བསོད་ནམས་ཀྱི་ཞིང་བླ་ན་མེད་པ། འཇིག་རྟེན་གྱི་ཡོན་གནས་ཡིན་ནོ་ཞེས་དགེ་འདུན་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: They are the unsurpassed field of merit, the rightful recipients of the offerings of the world.

source: ཚོང་པ་དག་དེའི་ཚེ་ཁྱེད་ཀྱིས་དགེ་འདུན་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ནས་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: “Merchants, if at that time you recollect the Saṅgha through these aspects, then whatever fear, trepidation, or terror you are experiencing will subside.

source: ཚོང་པ་དག་སྔོན་ལྷ་དང་ལྷ་མ་ཡིན་གྱི་གཡུལ་ཉེ་བར་གནས་པར་གྱུར་པ་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་སྨྲས་པ། གྲོགས་པོ་དག་གལ་ཏེ་ཁྱེད་ཅག་ལྷ་དང་། ལྷ་མ་ཡིན་གྱི་གཡུལ་དུ་ཞུགས་པ་ན། འཇིགས་པའམ། བག་ཚ་བའམ།
en: “Previously, merchants, when a battle between the devas and the asuras was about to break out, Śakra, the lord of the devas, called out to the devas of the Heaven of the Thirty-Three: ‘Friends, when you go into the battle between the devas and the asuras, if you feel any fear, trepidation, or terror, you should at that time recall my crest insignia Vaijayanta.

source: སྤུ་ཟིང་ཞེས་བྱེད་པ་སྐྱེ་བར་གྱུར་ན། དེའི་ཚེ་ཁྱེད་ཀྱིས་ངའི་རྒྱལ་མཚན་མཆོག་རྣམ་པར་རྒྱལ་བྱེད་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །དེའི་ཚེ་ཁྱེད་ཀྱིས་ངའི་རྒྱལ་མཚན་མཆོག་རྣམ་པར་རྒྱལ་བྱེད་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ།
en: If at that time you recollect my crest insignia Vaijayanta, then whatever fear, trepidation, or terror you are experiencing will subside.

source: བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་དེ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །གལ་ཏེ་ངའི་མི་དྲན་ན་ཡང་ལྷའི་བུ་དབང་ལྡན་གྱི་རྒྱལ་མཚན་མཆོག་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “ ‘If you cannot recollect my crest insignia, then recollect the crest insignia of the deva Īśāna.

source: དེའི་ཚེ་ཁྱེད་ཀྱིས་ལྷའི་བུ་དབང་ལྡན་གྱི་རྒྱལ་མཚན་མཆོག་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ།
en: If at that time you recollect the crest insignia of the deva Īśāna, then whatever fear, trepidation, or terror you are experiencing will subside.

source: སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །གལ་ཏེ་ལྷའི་བུ་དབང་ལྡན་གྱི་མི་དྲན་ན་ཡང་ལྷའི་བུ་ཆུ་ལྷའི་རྒྱལ་མཚན་མཆོག་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “ ‘If you cannot recollect the crest insignia of the deva Īśāna, then recollect the crest insignia of the deva Varuṇa.

source: དེའི་ཚེ་ཁྱེད་ཀྱིས་ལྷའི་བུ་ཆུ་ལྷའི་རྒྱལ་མཚན་མཆོག་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: If at that time you recollect the crest insignia of the deva Varuṇa, then whatever fear, trepidation, or terror you are experiencing will subside.

source: ཚོང་པ་དག་དེ་བཞིན་དུ་གལ་ཏེ་ཁྱེད་ཅག་ཀྱང་དགོན་པར་སོན་པ་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་སྐྱེ་བར་གྱུར་ན་དེའི་ཚེ་ཁྱེད་ཀྱིས་འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡིན་ནོ་ཞེས་ང་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “In the same way, merchants, when you are in the wilderness and feel fear, trepidation, or terror, at that time, you should recollect me through my aspects: “The Blessed One is a thus-gone one, a worthy one, a perfectly and completely awakened one, a learned and virtuous one, a well-gone one, a knower of the world, an unsurpassed leader of those to be trained, a teacher of devas and humans, an awakened one, and a blessed one.

source: གལ་ཏེ་ང་མི་དྲན་ན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ནི་ལེགས་པར་གསུངས་པ། ཡང་དག་པར་མཐོང་བ། ནད་མེད་པ། དུས་ཆད་པ་མེད་པ། ཉེ་བར་གཏོང་བ། འདི་མཐོང་བ་ལ་དོན་ཡོད་པ། མཁས་པ་རྣམས་ཀྱིས་རང་གིས་རིག་པར་བྱ་བ་ཡིན་ནོ་ཞེས་ཆོས་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་གྱིས་ཤིག །
en: “If you cannot recollect me, then recollect the Dharma through its aspects: “The Dharma of the Blessed One has been well spoken, it is to be seen for oneself, it is free from ailments, it is timeless, it is a guide, it is there in plain sight, and it is to be experienced by the wise for themselves.

source: ཚོང་པ་དག་དེའི་ཚེ་ཁྱེད་ཀྱིས་ཆོས་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: “Merchants, if at that time you recollect the Dharma through its aspects, whatever fear, trepidation, or terror you are experiencing will subside.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དེ་ནི་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ། ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཕུན་སུམ་ཚོགས་པ།
en: The Blessed One’s Saṅgha of śrāvakas is replete with discipline, replete with samādhi, replete with wisdom, replete with liberation, and replete with the knowledge and vision of liberation.

source: ཀུན་དུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ། རབ་ཏུ་སྦྱིན་པའི་འོས་སུ་གྱུར་པ། ཐལ་མོ་སྦྱར་བའི་འོས་སུ་གྱུར་པ། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ།
en: They are fully worthy of offerings, they are completely worthy of offerings, they are worthy of respect with joined palms, they are worthy of homage.

source: ཚོང་པ་དག་དེའི་ཚེ་ཁྱེད་ཀྱིས་དགེ་འདུན་རྣམ་པ་ལས་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱས་ན་འཇིགས་པའམ། བག་ཚ་བའམ། སྤུ་ཟིང་ཞེས་བྱེད་པ་འབྱུང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་མེད་པར་འགྱུར་རོ། །
en: “Merchants, if at that time you recollect the Saṅgha through its aspects, whatever fear, trepidation, or terror you are experiencing will subside.”

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་རང་རང་གི་ལག་ནས་བཟའ་བ་དང་། བཅའ་བ་གཙང་ཞིང་བསོད་པ་དག་ལེགས་པར་བསྟབས་ཤིང་ཡང་དག་པར་ཚིམ་པར་བྱས་སོ། །
en: Seeing that the Buddha and the saṅgha of monks were comfortably seated, the many merchants of Vaiśālī then graciously served them from their own hands the pure and wholesome foods and drinks and ensured they were satisfied.

source: རྣམ་གྲངས་དུ་མར་རང་རང་གི་ལག་ནས་བཟའ་བ་དང་། བཅའ་བ་གཙང་ཞིང་བསོད་པ་དག་ལེགས་པར་བསྟབས་ཤིང་ཡང་དག་པར་ཚིམ་པར་བྱས་ནས་བཅོམ་ལྡན་འདས་གདུགས་ཚོད་གསོལ་ཅིང་། ལྷུང་བཟེད་བཞག་སྟེ།
en: In various ways, they graciously served them from their own hands the pure and wholesome foods and drinks and ensured their satisfaction, and the Blessed One partook of the midday meal.

source: ཕྱག་བཅབས་པར་རིག་ནས་སྟན་ཤིན་ཏུ་དམའ་བ་དག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: When the many merchants of Vaiśālī saw that he had placed his alms bowl down and concealed his hands, they spread out low seats and sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་གི་སྦྱིན་པ་དེ་ལ་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རངས་པར་མཛད་དོ། །
en: The Blessed One rejoiced with delight at the generosity of the many merchants of Vaiśālī.

source: ཚོང་པ་ཟས་དང་སྐོམ་དག་གིས། །དགེ་སློང་དགེ་འདུན་བཤོས་གསོལ་བ། །རབ་ཏུ་ཤེས་ནས་གཏོང་བ་ཡི། །བློ་ལྡན་འཕགས་པ་གང་བྱེད་བཞིན། །
en: “O merchants, you have sustained The saṅgha of monks with food and drink In the manner of wise and noble beings Who, in their wisdom, practice generosity.

source: སྦྱིན་པ་བདེ་ལེགས་རྗོད་པ་འདི། །
en: [1] “This is a benediction for your offering.

source: ཚོང་པ་ཁྱེད་ཀྱིས་བྱིན་པས་ན། །ཁྱེད་ཅག་དོན་གང་ལེགས་འདོད་པའི། །ཁྱེད་ཀྱི་དོན་དེ་རྟག་གྲུབ་ཤོག །
en: By making this gift, O merchants, May the aims you rightfully desire Always be accomplished.

source: ཁྱེད་ཀྱི་རྐང་གཉིས་བདེ་ལེགས་ཤིང་། །
en: [2] “May there be goodness for those of you who travel on two feet.

source: ཁྱེད་ཀྱི་རྐང་བཞི་བདེ་ལེགས་ཤོག །
en: May there be goodness for those of you who travel on four feet.

source: ཁྱེད་ཅག་ལམ་ཞུགས་བདེ་ལེགས་ཤིང་། །ཕྱིར་ལྡོག་པ་ནའང་བདེ་ལེགས་ཤོག །
en: May there be goodness as you embark upon your journey, And may there be goodness when you return.

source: མཚན་མོ་བདེ་ལེགས་ཉིན་བདེ་ལེགས། །ཉི་མའི་གུང་ལ་བདེ་ལེགས་ཤིང་། །
en: [3] “May there be goodness all night and goodness all day, And may there be goodness at midday.

source: ཁྱེད་ཅག་ཀུན་དུ་བདེ་ལེགས་ལ། །ཁྱེད་ལ་སྡིག་པ་མ་འབྱུང་ཤིག །ཇི་ལྟར་ཞིང་ནི་ཕུན་སུམ་ལ། །
en: May you experience goodness in all situations, And may negativity never befall you.

source: ས་བོན་ཕུན་སུམ་ཚོགས་བཏབ་ཅིང་། །ཆར་པ་ཕུན་སུམ་ཚོགས་གྱུར་ན། །ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་འགྱུར། །
en: [4] “When perfect seeds are sown In perfect fields And enjoy perfect rainfall, A perfect harvest will abound.

source: གནོད་མེད་ཕུན་སུམ་ཚོགས་གྱུར་ཅིང་། །སྐྱེ་བ་ཕུན་སུམ་ཚོགས་གྱུར་ལ། །རྒྱས་པ་ཕུན་སུམ་ཚོགས་གྱུར་ན། །ལོ་ཏོག་ཕུན་སུམ་ཚོགས་འགྱུར་ལྟར། །
en: [5] “When perfectly free from damage, When crops grow with perfection And burst forth with perfection, A perfect harvest will abound.

source: དེ་བཞིན་ཚུལ་ཁྲིམས་ཕུན་ཚོགས་ལ། །ཁ་ཟས་ཕུན་སུམ་ཚོགས་བྱིན་ཞིང་། །ཕུན་སུམ་ཚོགས་ཕྱིར་དེ་བྱས་ན། །ཕུན་སུམ་ཚོགས་པ་འགྲུབ་པར་འགྱུར། །
en: [6] “So, too, by giving perfect foods To those with perfect discipline, You will accomplish perfection, For your act itself was perfect.

source: དེ་ཕྱིར་ཕུན་སུམ་ཚོགས་འདོད་ཅིང་། །ཕུན་ཚོགས་དོན་གཉེར་གང་ཟག་གིས། །ཤེས་རབ་ཕུན་ཚོགས་བསྟེན་གྱུར་ན། །དེས་ནི་ཕུན་སུམ་ཚོགས་པ་འགྲུབ། །
en: [7] “Thus, when people who seek perfection And strive toward perfection Attend to those with perfect wisdom, Perfection is what they accomplish.

source: དེ་ཕྱིར་བླ་མེད་སངས་རྒྱས་དང་། །ཆོས་དང་དགེ་འདུན་དག་ལ་ནི། །བརྟན་པ་དད་པ་སྐྱེད་བྱེད་པ། །དེ་སེམས་ཕུན་སུམ་ཚོགས་པར་འགྱུར། །
en: [8] “Thus, those with stable faith In the unsurpassed Buddha And in the Dharma and the Saṅgha Will find perfection of mind.

source: རིག་དང་ཞབས་སུ་ལྡན་པ་ལ། །ཕུན་སུམ་ཚོགས་པའི་སེམས་ཐོབ་ནས། །དགེ་བའི་ལས་རྣམས་བྱེད་གྱུར་པ། །
en: [9] “Those with perfect thoughts Toward the one with knowledge and conduct Perform virtuous actions.

source: དེ་ནི་ཕུན་སུམ་ཚོགས་པའི་ལས། །
en: This is the perfection of action.

source: འཇིག་རྟེན་ཡང་དག་བཞིན་ཤེས་ན། །ལྟ་བ་ཕུན་སུམ་ཚོགས་པ་འཐོབ། །
en: [10] “When one truly knows the world as it is, One attains the perfection of the view.

source: འཕགས་ཤིང་མཐོང་བ་ཕུན་ཚོགས་ན། །ཡིད་ནི་ཕུན་སུམ་ཚོགས་པར་འགྱུར།
en: When the noble vision is perfectly present, One’s mind becomes perfect too.

source: དྲི་མ་ཐམས་ཅད་བཅོམ་བྱས་ཤིང་། །མྱ་ངན་འདས་པ་ཕུན་སུམ་ཐོབ། །སྡུག་བསྔལ་ཟད་པར་བྱེད་པ་དེ། །དེ་ཡི་དོན་ནི་ཕུན་སུམ་ཡིན། །
en: [11] “Those who overcome all stains Attain the perfection of nirvāṇa And extinguish suffering; Their aim is perfectly complete.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ཚོང་པ་རབ་ཏུ་མང་པོ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: [12] The Blessed One taught, instructed, encouraged, and delighted the many merchants of Vaiśālī with this Dharma talk.

source: རྣམ་གྲངས་དུ་མར་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: Having taught, instructed, encouraged, and delighted them with this Dharma talk on various topics, the Blessed One rose from his seat and departed.

source: མདོ་ཆེན་པོ་རྒྱལ་མཚན་མཆོག་ཅེས་བྱ་བ་རྫོགས་སོ།། །།
en: This concludes the Mahāsūtra “The Crest Insignia.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲཛྙཱ་ཝརྨ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​།
en: Translated, edited, and finalized by the Indian preceptors Jinamitra and Prajñāvarman, the translator-editor Bandé Yeshé Dé, and others.
